const menuData = [
  {
    cmd: 'menufreefire',
    text: `*꒰⌢◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸ ✎ ꒱ 𐔌 FREE-FIRE 𐦯*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #purgatorio*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #kalafari*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #alpes*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #bermuda*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #formarsala*
*╰─ׅ─ׅ┈ ─๋︩︪─☪︎︎︎̸⃘̸࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬☃️⃘۪֟፝֯۫۫۫۬◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈ ─๋︩︪─╯*`,
    img: 'https://files.catbox.moe/3sf8cz.jpg'
  },
  {
    cmd: 'menusystem',
    text: `*꒰⌢◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸ ✎ ꒱ 𐔌 SISTEMA 𐦯*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #p*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #ping*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #menu*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #help*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #owner*
*╰─ׅ─ׅ┈ ─๋︩︪─☪︎︎︎̸⃘̸࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬☃️⃘۪֟፝֯۫۫۫۬◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈ ─๋︩︪─╯*`,
    img: 'https://files.catbox.moe/u87o1o.jpg'
  },
  {
    cmd: 'menuherramientas',
    text: `*꒰⌢◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸ ✎ ꒱ 𐔌 HERRAMIENTAS 𐦯*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #pinterest <texto>*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #catbox <imagen>*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #toimg <sticker>*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #pin <texto>*
*╰─ׅ─ׅ┈ ─๋︩︪─☪︎︎︎̸⃘̸࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬☃️⃘۪֟፝֯۫۫۫۬◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈ ─๋︩︪─╯*`,
    img: 'https://files.catbox.moe/3c5xp3.jpg'
  },
  {
    cmd: 'menudescargas',
    text: `*꒰⌢◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸ ✎ ꒱ 𐔌 DESCARGAS 𐦯
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #apkmod <texto>*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #apk*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #ig <enlace>*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #instagram*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #fb <enlace>*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #facebook*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #tt <enlace>*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #tiktok*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #mf <enlace>*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #mediafire*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #play <musica>*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #yts*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #ytv*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #play2*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #ytm3*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #ytmp4*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #yta*
*╰─ׅ─ׅ┈ ─๋︩︪─☪︎︎︎̸⃘̸࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬☃️⃘۪֟፝֯۫۫۫۬◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈ ─๋︩︪─╯*`,
    img: 'https://files.catbox.moe/b09zpc.jpg'
  },
  {
    cmd: 'menusockets',
    text: `*꒰⌢◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸ ✎ ꒱ 𐔌 SOCKETS  𐦯*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #qr*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #code*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #self <on/off>*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #sologp <on/off>*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #logout*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #leave*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #setname <nombre>*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #setbanner <foto>*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #setcurrency <moneda>*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #setmoneda <moneda>*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #set*
*╰─ׅ─ׅ┈─๋︩︪─☪︎︎︎̸⃘̸࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪⃘⃪𐇽۪۫۬֟፝֯۫۫۫۬🔔◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈─๋︩︪─╯*`,
    img: 'https://files.catbox.moe/25rnys.jpg'
  },
  {
    cmd: 'menuassistant',
    text: `*꒰⌢◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸ ✎ ꒱ 𐔌 ASISTANT 𐦯*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #ai*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #bard*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #chatgpt*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #dalle*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #flux*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #gemini*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #ia*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #iavoz*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #luminai*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #openai*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #yotsuba*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #yotsuba-nakano-ia*
*╰─ׅ─ׅ┈ ─๋︩︪─☪︎︎︎̸⃘̸࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬☃️⃘۪֟፝֯۫۫۫۬◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈ ─๋︩︪─╯*`,
    img: 'https://files.catbox.moe/7n8h8w.jpg'
  },
  {
    cmd: 'menujuegos',
    text: `*꒰⌢◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸ ✎ ꒱ 𐔌 JUEGOS  𐦯*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #formarpareja5*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #formarpareja*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #top*
*╰─ׅ─ׅ┈─๋︩︪─☪︎︎︎̸⃘࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬❄◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈─๋︩︪─╯*`,
    img: 'https://files.catbox.moe/txczpi.jpg'
  },
  {
    cmd: 'menugestion',
    text: `*꒰⌢◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸ ✎ ꒱ 𐔌 GESTIÓN 𐦯*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #testwelcome
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #testbye
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #bye <on/off>*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #welcome <on/off>*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #ant *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #antilink <on/off>*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #modoadmin <on/off>* 
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #detect <on/off>* 
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #open*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #close*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #abrir*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #cerrar*
*╰─ׅ─ׅ┈─๋︩︪─☪︎︎︎̸⃘࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬🔔◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈─๋︩︪─╯*`,
    img: 'https://files.catbox.moe/wqybzy.jpg'
  },
  {
    cmd: 'menurpg',
    text: `*꒰⌢◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸ ✎ ꒱ 𐔌 RPG  𐦯*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #daily*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #cofre*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #minar*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #rob*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #rob2*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #depositar <all>*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #d <all>*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #lvl*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #bal*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #baltop*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #w*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #trabajar*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #work*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #chambear*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #chamba*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #slut*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #prostituirse*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #perfil*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #profile*
*╰─ׅ─ׅ┈─๋︩︪─☪︎︎︎̸⃘࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬🎄◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈─๋︩︪─╯*`,
    img: 'https://files.catbox.moe/vykujz.jpg'
  },
  {
    cmd: 'menugrupos',
    text: `*꒰⌢◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸ ✎ ꒱ 𐔌 GRUPOS 𐦯*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #demote*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #promote*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #delete*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #kick*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #del*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #promover*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #degradar*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #delprimary*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #setprimary*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #tagall*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #invocar*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #todos*
*╰─ׅ─ׅ┈─๋︩︪─☪︎︎︎̸⃘࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬☃️◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈─๋︩︪─╯*`,
    img: 'https://files.catbox.moe/e8ihdv.jpg'
  },
  {
    cmd: 'menuowner',
    text: `*꒰⌢◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸ ✎ ꒱ 𐔌 OWNER  𐦯*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #autoadmin*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #join*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #update*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #spamwa*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #prefix*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #rprefix*
*╰─ׅ─ׅ┈─๋︩︪─☪︎︎︎̸⃘࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬❄⃘⃪۪֟፝֯۫۫۫۬◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈─๋︩︪─╯*`,
    img: 'https://files.catbox.moe/knz2g3.jpg'
  },
  // Nuevos menús
  {
    cmd: 'menunsfw',
    text: `*꒰⌢◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸ ✎ ꒱ 𐔌 NSFW  𐦯*
> *𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪ ❏ #sexo*
> *𑁍⃪࣭۪ٜ݊݊݊݊໑ٜ࣪ ❏ #69*
> *𑁍⃪࣭۪ٜ݊݊݊݊໑ٜ࣪ ❏ #violar*
> *𑁍⃪࣭۪ٜ݊݊݊݊໑ٜ࣪ ❏ #r34*
*╰─ׅ─ׅ┈─๋︩︪─☪︎︎︎̸⃘࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬🎁⃘۪֟፝֯۫۫۫۬◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈─๋︩︪─╯*`,
    img: 'https://files.catbox.moe/71w3um.jpg'
  },
  {
    cmd: 'menuemox',
    text: `*꒰⌢◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸ ✎ ꒱ 𐔌 EMOX  𐦯*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #bailar*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #dance*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #lamer*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #lamber*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #feliz*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #happy*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #triste*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #borracho
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #drunk*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #kill*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #matar*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #kiss*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #besar*
*╰─ׅ─ׅ┈─๋︩︪─☪︎︎︎̸⃘࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬☃️⃘⃪۪֟፝֯۫۫۫۬◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈─๋︩︪─╯*`,
    img: 'https://files.catbox.moe/0opdlz.jpg'
  },
  {
    cmd: 'menustickers',
    text: `*꒰⌢◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸ ✎ ꒱ 𐔌 STICKERS  𐦯*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #s*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #sticker*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #brat*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #qc*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #emojimix*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #take*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #wm*
> *𑁍⃪࣭۪ٜ݊݊њ໑ٜ࣪ ❏ #bratv*
*╰─ׅ─ׅ┈─๋︩︪─☪︎︎︎̸⃘࣭ٜ࣪࣪࣪۬◌⃘۪֟፝֯۫۫︎⃪𐇽۫۬🌟◌⃘࣭ٜ࣪࣪࣪۬☪︎︎︎︎̸─ׅ─ׅ┈─๋︩︪─╯*`,
    img: 'https://files.catbox.moe/folwv0.jpg'
  }
]

// Comandos permitidos (regex)
const commands = menuData.map(m => m.cmd)

const handler = async (m, { conn, command }) => {
  const key = command.toLowerCase()
  const menu = menuData.find(m => m.cmd === key)
  
  if (menu) {
    await conn.sendMessage(m.chat, {
      image: { url: menu.img },
      caption: menu.text
    }, { quoted: m })
  } else {
    // Mensaje de error con lista de menús
    await conn.sendMessage(m.chat, {
      text: `❌ Menú no encontrado.\nMenús disponibles:\n` + commands.map(c => `#${c}`).join('\n')
    }, { quoted: m })
  }
}

handler.help = commands
handler.tags = ['menu']
handler.command = new RegExp(`^(${commands.join('|')})$`, "i")

export default handler